# Reboot - SQL Advanced

Tonight, we will use a Blog SQLite database:

In [1]:
!tree

.
├── data
│   └── blog.sqlite
├── README.md
└── recap.ipynb

1 directory, 3 files

## 1. Schema ERD

❓ Open the `data/blog.sqlite` in DBeaver, explore the schema and draw it on [kitt.lewagon.com/db](https://kitt.lewagon.com/db).

_TODO: Double click this cell and **paste** a screenshot of the schema for future reference_.

---
## 2. Most liked posts

Complete the code to get **the 3 most liked posts**:

In [9]:
import sqlite3

conn = sqlite3.connect("data/blog.sqlite")
c = conn.cursor()

# TODO: write the query
query = """
select 
    p.title, 
    p.content, 
    count(*) as cnt
from posts p
join likes l on l.post_id = p.id 
group by l.post_id 
order by cnt desc
limit 3
"""
c.execute(query)
results = c.fetchall()
# TODO: Execute the query
results
# TODO: Fetch and print the results

[('Half imagine another.',
  'Nice career practice image. Modern son per share painting successful on.',
  84),
 ('Side foot leader popular.',
  'Relate parent run public choice allow. Establish single far Congress impact course offer.',
  82),
 ('Area paper whatever mean.',
  'Space whose often computer. Yard account stuff section write store somebody. Coach none blue skin finish any.',
  81)]

---

### Pretty Print using _pandas_

The readbility of our `print()` statements are not so good.

Next week, we will introduce [pandas](https://pandas.pydata.org/) which will largely improve the UX of our Data Exploration in Notebooks.

Execute the following cell:

In [11]:
import pandas as pd

Then try again the previous `query`, delegating the job of fetching results + displaying them to the `execute_and_print` function and `pandas`:

In [12]:
pd.read_sql_query(query, conn)

,title,content,cnt
0,Half imagine another.,Nice career practice image. Modern son per sha...,84
1,Side foot leader popular.,Relate parent run public choice allow. Establi...,82
2,Area paper whatever mean.,Space whose often computer. Yard account stuff...,81

---
## 3. Find the three users who 'liked' the most

In [13]:
pd.read_sql_query("""
select 
	u.first_name ||" "|| u.last_name AS name , 
	count(*) as cnt
from users u
join likes l on u.id = l.user_id 
group by l.user_id 
order by cnt desc
limit 3
""", conn)

              name  cnt
0    Michael Allen  236
1    Donna Ramirez  233
2  Hayley Williams  227

---
## 4. Find the most liked author

In [16]:
pd.read_sql_query("""
select
	u.first_name || " " || u.last_name as name,
	count(*) as cnt 
from users u
join posts p on p.user_id = u.id 
join likes l on l.post_id = p.id 
group by name 
order by cnt DESC 
limit 1
""", conn)

           name  cnt
0  Teresa Moore  647

---
## 5. Who are the authors of the 3 most liked posts?

In [15]:
pd.read_sql_query("""
select 
	u.first_name ||" "|| u.last_name AS name,
	count(*) as cnt,
	p.id
from posts p
join likes l on l.post_id = p.id 
join users u on u.id = p.user_id 
group by l.post_id 
order by cnt DESC 
limit 3
""", conn)

              name  cnt   id
0    Melissa Henry   84  143
1  Cynthia Raymond   82   83
2   Alexander Cook   81   99

---
## 6. How many people liked at least one post?

In [20]:
pd.read_sql_query("""
select count(distinct user_id) distinct_likers from likes 
""", conn)

   distinct_likers
0               49

---
## 7. Compute the cumulative number of likes per day

In [21]:
pd.read_sql_query("""
with cnt as (
	select
		created_at ,
		count(likes.id) as daily_cnt
	from likes
	group by created_at 
)
select 
	created_at, 
	SUM(daily_cnt) over (
		order by created_at
		)
from cnt
""", conn)

     created_at  SUM(daily_cnt) over (\n\t\torder by created_at\n\t\t)
0    2019-01-01                                                 24
1    2019-01-02                                                 58
2    2019-01-03                                                 98
3    2019-01-04                                                134
4    2019-01-05                                                161
..          ...                                                ...
331  2019-12-24                                               9882
332  2019-12-25                                               9915
333  2019-12-26                                               9947
334  2019-12-27                                               9970
335  2019-12-28                                              10000

[336 rows x 2 columns]

---
## 8. (Optional) Who's the biggest fan of each author?

The biggest fan of an author is defined as the user who liked the most the author's posts.
<br><br>
<details>
    <summary>💡 Click for Hint</summary>
    You might need to use <code>WITH</code>
</details>

In [ ]:
pd.read_sql_query("""
TODO: Write the SQL query
""", conn)